/******************** (C) COPYRIGHT 2010 Embest Info&Tech Co.,LTD. ************
* 文件名: retarget.c
* 作者  : Wuhan R&D Center, Embest
* 日期  : 01/18/2010
* 描述  : 标准I/O函数的重定义
*******************************************************************************
*******************************************************************************
* 历史:
* 01/18/2010		 : V1.0		   初始版本
*******************************************************************************/
/* Includes ------------------------------------------------------------------*/
#include <stdio.h>
#include "LPC11xx.h"
#include "uart.h" 

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/  


  /**
  * @函数名：fputc
  * @描述：重新定义fputc函数
  * @参数： ch 要打印的字符
  * @       f  文件指针  
  * @返回值：返回所打印的字符
  */
int fputc(int ch, FILE *f)
{
  /* 循环知道发送结束 */
  while (!(LPC_UART->LSR & LSR_THRE))
  {	  
  }
  /* 你自己实现的fputc放置到这里 */
  /* 例如写一个字符到USART */  
  LPC_UART->THR = ch;

  return ch;
}
/**
  * @}
  */ 

/**
  * @}
  */ 
/************* (C) COPYRIGHT 2010 Wuhan R&D Center, Embest *****文件结束*******/
